anton-vinogradov/esp32-leshy/src/main.cpp
#elif DEMO == DEMO_DASHBOARD

#include <Preferences.h>

#include "features/wifi_scanner/HiddenRevealer.h"
#include "features/ota/OtaManager.h"
#include "features/display/img_rider.h"
#include "features/display/font_ru_small.h"
#include "features/legal/LegalText.h"
#include "core/version.h"

ScanEngine     engine;
WifiScreen     wifiScreen;
BleScreen      bleScreen;
MenuScreen     menuScreen;
Buttons        buttons;
NetManager     net;
HiddenRevealer revealer;
OtaManager     ota;
DeauthDetector detector;
StatusLeds     leds;             // the four WS2812s under the antennas — shows what the radio is doing
AirtimeMonitor airtime;          // real per-channel airtime (promiscuous) for the Channels screen
Nrf24Spectrum  nrf;              // NRF24 raw 2.4GHz spectrum sniffer
Cc1101Spectrum cc;              // CC1101 sub-GHz spectrum sniffer

static void drawNetBadge();      // small "connected" mark in the header (defined below)
static void gotoWifi();          // (re)enter the live Wi-Fi scan
static void ensureWifiVisible(); // keep the selected scan row on screen
static int  drawWrapped(const char* s, int x, int y, int maxw, int lh, int maxlines);  // word-wrap (defined below)
static void openNetOptions();    // RIGHT on a scan row -> per-network options
static void drawNetDetails();    // details screen for the selected network

// ---- menu tree ----
enum { M_ROOT, M_WIFI, M_BLE, M_SUBGHZ, M_SETTINGS, M_LANG, M_WIFI_ADV };
enum { F_WIFI_SCAN, F_CONN, F_HIDDEN, F_DEAUTH, F_CHANNELS, F_SPECTRUM, F_BLE_SCAN, F_SUBSPECTRUM, F_SUBGHZ_SOON, F_RECAL, F_ABOUT, F_OTA, F_LEGAL, F_LEDS, F_BACKLIGHT, F_LANG_EN, F_LANG_RU };
static const uint8_t K_SUB = 0, K_FEAT = 1;

static const MenuItem ROOT_I[] = {
    {"Wi-Fi",    "Scan networks",            "Wi-Fi",     "Сканирование сетей",       K_SUB, M_WIFI},
    {"BLE",      "Bluetooth devices & tags", "BLE",       "Устройства и метки",       K_SUB, M_BLE},
    {"Sub-GHz",  "315/433/868 MHz radio",    "Sub-GHz",   "Радио 315/433/868 МГц",    K_SUB, M_SUBGHZ},
    {"Settings", "Language, touch, about",   "Настройки", "Язык, тач, о девайсе",     K_SUB, M_SETTINGS},
};
static const MenuItem WIFI_I[] = {
    {"Wi-Fi Scan",    "Signal, channel, lock", "Скан Wi-Fi",    "Сигнал, канал, шифр",   K_FEAT, F_WIFI_SCAN},
    {"Channels 2.4G", "Airtime per channel",   "Каналы 2.4ГГц", "Занятость по каналам",  K_FEAT, F_CHANNELS},
    {"Spectrum 2.4G", "Raw band waterfall (NRF24)", "Спектр 2.4ГГц", "Водопад по спектру (NRF24)", K_FEAT, F_SPECTRUM},
    {"Advanced",      "Deeper Wi-Fi tools",    "Продвинутое",   "Инструменты поглубже",  K_SUB,  M_WIFI_ADV},
};
static const MenuItem WADV_I[] = {
    {"Hidden names",   "Revealed hidden SSIDs",  "Скрытые сети",  "Раскрытые имена",       K_FEAT, F_HIDDEN},
    {"Deauth monitor", "Alarm on deauth bursts", "Детектор атак", "Тревога на отключения", K_FEAT, F_DEAUTH},
};
static const MenuItem BLE_I[] = {
    {"BLE Scan", "Devices & trackers nearby", "Скан BLE", "Устройства и трекеры рядом", K_FEAT, F_BLE_SCAN},
};
static const MenuItem SUB_I[] = {
    {"Spectrum", "Sub-GHz waterfall (CC1101)", "Спектр", "Водопад Sub-GHz (CC1101)", K_FEAT, F_SUBSPECTRUM},
    {"Recorder", "Record RF signals (soon)",   "Запись", "Запись сигналов (скоро)",   K_FEAT, F_SUBGHZ_SOON},
};
static const MenuItem SET_I[] = {
    {"Wi-Fi connect",   "Status, join, exit",      "Wi-Fi подключение", "Статус, вход, выход",   K_FEAT, F_CONN},
    {"Update",          "Update from GitHub",      "Обновление",        "Обновить с GitHub",     K_FEAT, F_OTA},
    {"Language",        "Interface language",      "Язык",        "Язык интерфейса",       K_SUB,  M_LANG},
    {"Status LEDs",     "Brightness / off",        "Светодиоды",  "Яркость / выкл",        K_FEAT, F_LEDS},
    {"Screen light",    "Screen brightness",       "Яркость экрана", "Подсветка дисплея",   K_FEAT, F_BACKLIGHT},
    {"Calibrate touch", "Redo screen calibration", "Калибровка",  "Перекалибровать экран", K_FEAT, F_RECAL},
    {"About",           "About ESP32-Leshy",       "О девайсе",   "Об ESP32-Leshy",        K_FEAT, F_ABOUT},
    {"Responsible use", "Legal terms — read it",   "Ответственность", "Правила — прочти",  K_FEAT, F_LEGAL},
};
static const MenuItem LANG_I[] = {
    {"English", "", "English", "", K_FEAT, F_LANG_EN},
    {"Русский", "", "Русский", "", K_FEAT, F_LANG_RU},
};
static const Menu MENUS[] = {
    {"ESP32-Leshy", "ESP32-Leshy", ROOT_I, 4},
    {"Wi-Fi",       "Wi-Fi",       WIFI_I, 4},
    {"BLE",         "BLE",         BLE_I,  1},
    {"Sub-GHz",     "Sub-GHz",     SUB_I,  2},
    {"Settings",    "Настройки",   SET_I,  8},
    {"Language",    "Язык",        LANG_I, 2},
    {"Advanced",    "Продвинутое", WADV_I, 2},
};

// ---- navigation state ----
enum State { ST_MENU, ST_WIFI, ST_BLE, ST_INFO, ST_PROVISION, ST_CONN, ST_HIDDEN, ST_CONFIRM, ST_OPTIONS, ST_OTA, ST_DEAUTH, ST_CHANNELS, ST_SPECTRUM, ST_SUBSPECTRUM, ST_NETINFO, ST_LEGAL, ST_LANGPICK };
static State    st = ST_MENU;
static int      menuStack[6] = { M_ROOT };   // path of open menus (for back)
static int      selStack[6]  = { 0 };        // selection per level
static int      depth = 0;
static int      off = 0;
static int      wifiSel = 0;     // selected row in the Wi-Fi scan
static WifiRow  netSel;          // network the per-network options act on
static uint32_t seenWifiGen = 0, seenBleGen = 0;
static uint32_t scanPausedAt = 0;   // when the scan was paused (net options) — long gaps invalidate the RSSI graph
static bool     touchDown = false;
static String   infoTitle, infoBody, infoNote;
static int      infoAction = -1;   // F_LEDS / F_BACKLIGHT when the info screen is an adjustable setting (SELECT cycles it in place), else -1

static int  curMenu() { return menuStack[depth]; }
static int& curSel()  { return selStack[depth]; }
// In a menu the radios are idle — scanning only runs on a scan screen.
static void showMenu() { engine.pause(); st = ST_MENU; menuScreen.show(&MENUS[curMenu()], curSel(), depth > 0); drawNetBadge(); }

static void saveLang(Lang l) { Preferences p; p.begin("leshy", false); p.putUChar("lang", (uint8_t)l); p.end(); }
static Lang loadLang() { Preferences p; p.begin("leshy", true); uint8_t v = p.getUChar("lang", (uint8_t)UI_LANG); p.end(); return (Lang)v; }

static int  listCount() { return st == ST_WIFI ? engine.wifiCount() : engine.bleCount(); }
static void drawList(bool full) {
    if (st == ST_WIFI) { if (full) wifiScreen.draw(engine, off, wifiSel); else wifiScreen.rows(engine, off, wifiSel); }
    else               { if (full) bleScreen.draw(engine, off);  else bleScreen.rows(engine, off); }
}

