anton-vinogradov/esp32-leshy/src/main.cpp
static void drawInfo() {
    uiHeaderRu(infoTitle.c_str());
    tft.fillRect(0, 28, 240, 320 - 28, uiBg());
    fontSmall();
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(tft.color565(0xe8, 0xe8, 0xe0), uiBg());
    int y = drawWrapped(infoBody.c_str(), 10, 50, 220, 24, 3);   // word-wrap, no mid-word breaks
    if (infoNote.length()) {
        tft.setTextColor(tft.color565(0xff, 0xcf, 0x3f), uiBg());
        drawWrapped(infoNote.c_str(), 10, y + 14, 220, 24, 7);
    }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back",
               infoAction >= 0 ? (i18n::isRu() ? "менять ▶" : "change ▶") : nullptr);
    fontOff();
    drawNetBadge();
}

// Adjustable-setting info screens: show the CURRENT value; SELECT/RIGHT cycles in place.
static void drawLedsInfo() {
    uint8_t b = leds.brightness();
    infoTitle = i18n::tr("Status LEDs", "Светодиоды");
    infoBody  = b ? String(i18n::tr("Brightness ", "Яркость ")) + b + "/255"
                  : String(i18n::tr("Off", "Выключены"));
    infoNote  = i18n::tr("Press ▶ to change. LEDs under the antennas show what the radio is doing.",
                         "Жми ▶ для смены. Светодиоды под антеннами показывают работу радио.");
    infoAction = F_LEDS; st = ST_INFO; drawInfo();
}
static void drawBacklightInfo() {
    uint8_t v = uiBacklightLevel();
    infoTitle = i18n::tr("Screen light", "Яркость экрана");
    infoBody  = String(v * 100 / 255) + "%";
    infoNote  = i18n::tr("Press ▶ to change the screen brightness.",
                         "Жми ▶ для смены яркости экрана.");
    infoAction = F_BACKLIGHT; st = ST_INFO; drawInfo();
}

static void drawProvisionScreen() {
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xe7, 0xcf, 0x8f);
    uiHeaderRu(i18n::tr("Wi-Fi setup", "Настройка Wi-Fi"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("1. Join Wi-Fi:", "1. Подключись к Wi-Fi:"), 10, 46);
    fontBig();   tft.setTextColor(gold, bg);
    tft.drawString(NetManager::apName(), 10, 68);
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("2. Open in browser:", "2. Открой в браузере:"), 10, 112);
    fontBig();   tft.setTextColor(gold, bg);
    tft.drawString("192.168.4.1", 10, 134);
    fontSmall(); tft.setTextColor(white, bg);
    tft.drawString(i18n::tr("3. Pick network + password", "3. Выбери сеть + пароль"), 10, 178);
    uiFooterRu(i18n::tr("◀ cancel", "◀ отмена"));
    fontOff();
}

// Small "connected" mark in the top-right of the header: three gold bars, drawn
// only while actually associated. Scanning drops the link, so it honestly
// disappears on the scan screens.
static void drawNetBadge() {
    bool conn = net.connected();
    bool upd  = (ota.phase() == OtaManager::AVAILABLE);
    if (!conn && !upd) return;
    if (upd) {                                   // amber up-arrow: an update is waiting
        const uint16_t amber = tft.color565(0xff, 0xa5, 0x2a);
        tft.fillTriangle(190, 8, 184, 20, 196, 20, amber);
        tft.fillRect(187, 18, 6, 4, amber);
    }
    if (conn) {                                  // gold signal bars: connected
        const uint16_t gold = tft.color565(0xff, 0xcf, 0x3f);
        int x = 210, base = 21;
        tft.fillRect(x,      base - 6,  4, 6,  gold);
        tft.fillRect(x + 6,  base - 10, 4, 10, gold);
        tft.fillRect(x + 12, base - 14, 4, 14, gold);
    }
}

// ---- hidden (revealed) SSID list ----
static const int HID_TOP = 40, HID_ROW_H = 30, HID_VISIBLE = 8;
static int hidSel = 0, hidOff = 0, hidRowY[HID_VISIBLE];

// One list row, repainted in place (fills only its own rectangle — no full-screen clear).
static void drawHiddenRow(int slot) {
    fontOff();                    // rows use the built-in fonts (2/1); drop any smooth font first
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t dim   = tft.color565(0x8f, 0xa9, 0x8f);
    int n   = revealer.count();
    int idx = hidOff + slot;
    int y   = HID_TOP + slot * HID_ROW_H;
    hidRowY[slot] = (idx < n) ? y : -1;
    tft.fillRect(0, y, 240, HID_ROW_H, bg);
    if (idx >= n) return;
    uint8_t b[6]; String ss;
    revealer.get(idx, b, ss);
    bool sel = (idx == hidSel);
    uint16_t rowbg = sel ? tft.color565(0x22, 0x33, 0x22) : bg;
    if (sel) tft.fillRoundRect(6, y, 228, HID_ROW_H - 4, 6, rowbg);
    if (ss.length() > 18) ss = ss.substring(0, 17) + "~";
    tft.setTextDatum(TL_DATUM);
    tft.setTextColor(sel ? gold : white, rowbg);
    tft.drawString(ss, 12, y + 1, 2);
    char mac[18];
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X", b[0], b[1], b[2], b[3], b[4], b[5]);
    tft.setTextColor(dim, rowbg);
    tft.drawString(mac, 12, y + 16, 1);
}

static void clampHidden() {
    int n = revealer.count();
    if (hidSel > n - 1) hidSel = n - 1;
    if (hidSel < 0) hidSel = 0;
    if (hidSel < hidOff) hidOff = hidSel;                      // stop when the screen would start to empty
    if (hidSel >= hidOff + HID_VISIBLE) hidOff = hidSel - HID_VISIBLE + 1;
    if (hidOff < 0) hidOff = 0;
}

static void drawHiddenRowsOnly() { for (int s = 0; s < HID_VISIBLE; s++) drawHiddenRow(s); }

static void drawHiddenScreen() {
    const uint16_t bg = uiBg();
    const uint16_t dim = tft.color565(0x8f, 0xa9, 0x8f);
    int n = revealer.count();
    uiHeaderRu(i18n::tr("Hidden names", "Скрытые сети"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    if (n == 0) {
        fontSmall();
        tft.setTextDatum(TL_DATUM); tft.setTextColor(dim, bg);
        tft.drawString(i18n::tr("Empty yet.", "Пока пусто."), 12, 70);
        tft.drawString(i18n::tr("Scan near a hidden", "Сканируй рядом со"), 12, 96);
        tft.drawString(i18n::tr("network to reveal.", "скрытой сетью."), 12, 118);
        uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back");
        fontOff(); drawNetBadge(); return;
    }
    clampHidden();
    drawHiddenRowsOnly();
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::isRu() ? "опции ▶" : "options ▶");
    drawNetBadge();
}

static void gotoHidden() { st = ST_HIDDEN; drawHiddenScreen(); }

// ---- connection screen (one menu item: full status + contextual actions) ----
enum ConnAct { CA_SETUP, CA_CONNECT, CA_DISCONNECT, CA_FORGET };
static ConnAct connActs[4];
static int     connActN = 0, connSel = 0, connActY[4];

static void buildConnActions() {
    connActN = 0;
    bool has = net.hasCreds(), on = net.connected();
    if (!has) { connActs[connActN++] = CA_SETUP; }
    else {
        connActs[connActN++] = on ? CA_DISCONNECT : CA_CONNECT;
        connActs[connActN++] = CA_SETUP;
        connActs[connActN++] = CA_FORGET;
    }
    if (connSel >= connActN) connSel = 0;
}

static const char* connLabel(ConnAct a) {
    switch (a) {
        case CA_SETUP:      return i18n::tr("Set up (phone)", "Настроить (телефон)");
        case CA_CONNECT:    return i18n::tr("Connect",        "Подключиться");
        case CA_DISCONNECT: return i18n::tr("Disconnect",     "Отключиться");
        case CA_FORGET:     return i18n::tr("Forget network", "Забыть сеть");
    }
    return "";
}

// Reusable action button, repainted in place (fills only its own rectangle).
static void drawActionBtn(int y, const char* label, bool sel) {
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    uint16_t box = sel ? tft.color565(0x2c, 0x5a, 0x2c) : tft.color565(0x1b, 0x27, 0x1b);
    tft.fillRoundRect(10, y, 220, 34, 8, box);
    fontSmall();
    tft.setTextColor(sel ? gold : white, box);
    tft.setTextDatum(ML_DATUM);
    tft.drawString(label, 22, y + 17);
    fontOff();
}

static void drawConnScreen() {
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t dim   = tft.color565(0x8f, 0xa9, 0x8f);
    uiHeaderRu(i18n::tr("Connection", "Подключение"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall();
    int y = 44;
    bool has = net.hasCreds(), on = net.connected();
    if (on) {
        tft.setTextColor(gold, bg);  tft.drawString(i18n::tr("Connected:", "Подключено:"), 10, y); y += 24;
        tft.setTextColor(white, bg); tft.drawString(net.savedSsid(), 12, y); y += 22;
        tft.setTextColor(dim, bg);   tft.drawString("IP " + net.ip(), 12, y); y += 26;
    } else if (has) {
        tft.setTextColor(white, bg); tft.drawString(i18n::tr("Saved network:", "Сохранённая сеть:"), 10, y); y += 24;
        tft.setTextColor(gold, bg);  tft.drawString(net.savedSsid(), 12, y); y += 22;
        tft.setTextColor(dim, bg);   tft.drawString(i18n::tr("not connected", "не подключено"), 12, y); y += 26;
    } else {
        tft.setTextColor(white, bg); tft.drawString(i18n::tr("Not set up", "Не настроено"), 10, y); y += 24;
        tft.setTextColor(dim, bg);   tft.drawString(i18n::tr("add via phone below", "настрой с телефона ниже"), 12, y); y += 26;
    }
    y += 6;
    fontOff();
    for (int i = 0; i < connActN; i++) { connActY[i] = y; drawActionBtn(y, connLabel(connActs[i]), i == connSel); y += 42; }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back");
    fontOff();
    drawNetBadge();
}

static void gotoConn() { buildConnActions(); st = ST_CONN; drawConnScreen(); }

