anton-vinogradov/esp32-leshy/src/main.cpp
// ---- confirm dialog (destructive actions) ----
enum PendKind { PK_NONE, PK_FORGET, PK_DEL_HIDDEN };
static PendKind pendKind = PK_NONE;
static int      pendIdx = 0;
static State    confirmReturn = ST_MENU;
static String   confirmMsg, confirmSub;
static const int okBtnY = 214, cancelBtnY = 262;

static void drawConfirm() {
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t okbg  = tft.color565(0x7a, 0x25, 0x25);
    const uint16_t cbg   = tft.color565(0x22, 0x2a, 0x22);
    uiHeaderRu(i18n::tr("Confirm", "Подтверждение"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    tft.setTextDatum(TL_DATUM);
    fontSmall();
    tft.setTextColor(white, bg); tft.drawString(confirmMsg, 12, 74);
    tft.setTextColor(gold, bg);  tft.drawString(confirmSub, 12, 104);
    tft.fillRoundRect(10, okBtnY, 220, 40, 8, okbg);
    tft.setTextDatum(MC_DATUM); tft.setTextColor(white, okbg);
    tft.drawString(i18n::tr("OK (middle)", "OK (средняя)"), 120, okBtnY + 20);
    tft.fillRoundRect(10, cancelBtnY, 220, 40, 8, cbg);
    tft.setTextColor(white, cbg);
    tft.drawString(i18n::tr("Cancel (LEFT)", "Отмена (LEFT)"), 120, cancelBtnY + 20);
    fontOff();
}

static void askConfirm(PendKind kind, int idx, const char* msg, const String& sub, State ret) {
    pendKind = kind; pendIdx = idx; confirmMsg = msg; confirmSub = sub; confirmReturn = ret;
    st = ST_CONFIRM; drawConfirm();
}

static void doConfirm() {
    switch (pendKind) {
        case PK_FORGET:     net.forget();             break;
        case PK_DEL_HIDDEN: revealer.remove(pendIdx); break;
        default: break;
    }
    pendKind = PK_NONE;
    if (confirmReturn == ST_HIDDEN) gotoHidden(); else gotoConn();
}

static void cancelConfirm() {
    pendKind = PK_NONE;
    if (confirmReturn == ST_HIDDEN) gotoHidden(); else gotoConn();
}

static void connActivate() {
    switch (connActs[connSel]) {
        case CA_SETUP: net.startProvision(); st = ST_PROVISION; drawProvisionScreen(); break;
        case CA_CONNECT:
            infoTitle = i18n::tr("Connecting...", "Подключение..."); infoBody = net.savedSsid(); infoNote = ""; infoAction = -1;
            st = ST_INFO; drawInfo();
            net.connect();
            if (net.connected()) ota.startCheck();   // auto-check for updates on connect
            gotoConn();
            break;
        case CA_DISCONNECT: net.disconnect(); connSel = 0; gotoConn(); break;
        case CA_FORGET:     askConfirm(PK_FORGET, 0, i18n::tr("Forget this network?", "Забыть эту сеть?"), net.savedSsid(), ST_CONN); break;
    }
}

// ---- options menu (RIGHT opens context actions for the selected item) ----
enum OptId { OPT_DEL_HIDDEN, OPT_NET_DETAILS };
static OptId       optIds[4];
static const char* optLabels[4];
static int         optN = 0, optSel = 0, optY[4];
static State       optReturn = ST_MENU;
static String      optTitle;

static void drawOptionsScreen() {
    const uint16_t bg = uiBg();
    const uint16_t dim = tft.color565(0x8f, 0xa9, 0x8f);
    uiHeaderRu(i18n::tr("Options", "Опции"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    fontSmall();
    tft.setTextDatum(TL_DATUM); tft.setTextColor(dim, bg);
    String t = optTitle; if (t.length() > 24) t = t.substring(0, 23) + "~";
    tft.drawString(t, 12, 46);
    fontOff();
    int y = 84;
    for (int i = 0; i < optN; i++) { optY[i] = y; drawActionBtn(y, optLabels[i], i == optSel); y += 42; }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back");
    drawNetBadge();
}

static void openHiddenOptions() {
    if (revealer.count() == 0) return;
    uint8_t b[6]; String ss;
    revealer.get(hidSel, b, ss);
    optTitle = ss;
    optN = 0;
    optLabels[optN] = i18n::tr("Delete name", "Удалить имя"); optIds[optN] = OPT_DEL_HIDDEN; optN++;
    optSel = 0; optReturn = ST_HIDDEN;
    st = ST_OPTIONS; drawOptionsScreen();
}

static void optActivate() {
    switch (optIds[optSel]) {
        case OPT_DEL_HIDDEN:  revealer.remove(hidSel); gotoHidden(); break;
        case OPT_NET_DETAILS: drawNetDetails(); st = ST_NETINFO; break;
    }
}

// ---- OTA update screen (full-bleed rider background + progress slider) ----
static uint32_t seenOtaGen = 0;
static int      seenOtaPhase = -1;

static const char* otaErrText(OtaManager::Err e) {
    switch (e) {
        case OtaManager::E_NONET:     return i18n::tr("No network",        "Нет сети");
        case OtaManager::E_TIME:      return i18n::tr("No clock (SNTP)",   "Нет времени");
        case OtaManager::E_API:       return i18n::tr("Server error",      "Ошибка сервера");
        case OtaManager::E_NORELEASE: return i18n::tr("No releases yet",   "Релизов пока нет");
        case OtaManager::E_RATELIMIT: return i18n::tr("Rate limited",      "Лимит запросов");
        case OtaManager::E_PARSE:     return i18n::tr("Bad response",      "Плохой ответ");
        case OtaManager::E_NOASSET:   return i18n::tr("No firmware.bin",   "Нет firmware.bin");
        case OtaManager::E_HTTP:      return i18n::tr("Download error",    "Ошибка загрузки");
        case OtaManager::E_BEGIN:     return i18n::tr("No OTA slot",       "Нет OTA-слота");
        case OtaManager::E_WRITE:     return i18n::tr("Flash error",       "Ошибка записи");
        case OtaManager::E_SHORT:     return i18n::tr("Interrupted",       "Прервано");
        case OtaManager::E_HASH:      return i18n::tr("Checksum mismatch", "Хеш не сошёлся");
        case OtaManager::E_END:       return i18n::tr("Bad image",         "Битый образ");
        case OtaManager::E_NOMEM:     return i18n::tr("Low memory",        "Мало памяти");
        default:                      return "";
    }
}

// A short "what to do" hint per error — the actionable half of a full-screen error.
static const char* otaHintText(OtaManager::Err e) {
    switch (e) {
        case OtaManager::E_NONET:     return i18n::tr("Join your Wi-Fi in Connection, then retry.", "Подключись к своему Wi-Fi в «Подключении» и повтори.");
        case OtaManager::E_TIME:      return i18n::tr("The clock needs internet. Wait a bit and retry.", "Часам нужен интернет. Подожди немного и повтори.");
        case OtaManager::E_API:       return i18n::tr("No answer from GitHub. Retry; if it persists, check the net.", "Нет ответа от GitHub. Повтори; если не поможет — проверь сеть.");
        case OtaManager::E_NORELEASE: return i18n::tr("No release has been published yet.", "Релиз ещё не опубликован.");
        case OtaManager::E_RATELIMIT: return i18n::tr("GitHub rate limit. Wait about an hour.", "Лимит запросов GitHub. Подожди примерно час.");
        case OtaManager::E_PARSE:     return i18n::tr("GitHub sent an unreadable reply. Retry.", "GitHub прислал нечитаемый ответ. Повтори.");
        case OtaManager::E_NOASSET:   return i18n::tr("The release has no firmware.bin file.", "В релизе нет файла firmware.bin.");
        case OtaManager::E_HTTP:      return i18n::tr("Download failed. Check the net and retry.", "Загрузка не удалась. Проверь сеть и повтори.");
        case OtaManager::E_BEGIN:     return i18n::tr("No room for the update image.", "Нет места под образ обновления.");
        case OtaManager::E_WRITE:     return i18n::tr("Flash write failed. Retry.", "Сбой записи во флеш-память. Повтори.");
        case OtaManager::E_SHORT:     return i18n::tr("The download was cut off. Retry.", "Загрузка оборвалась. Повтори.");
        case OtaManager::E_HASH:      return i18n::tr("Checksum mismatch — the file is corrupt. Retry.", "Хеш не сошёлся — файл повреждён. Повтори.");
        case OtaManager::E_END:       return i18n::tr("The image was rejected. Retry.", "Образ отвергнут системой. Повтори.");
        case OtaManager::E_NOMEM:     return i18n::tr("Not enough RAM. Reboot the device and retry.", "Не хватило памяти. Перезагрузи устройство и повтори.");
        default:                      return "";
    }
}

// Word-wrap a string at maxw px (font must already be loaded, datum TL, color set). Returns next y.
static int drawWrapped(const char* s, int x, int y, int maxw, int lh, int maxlines) {
    char line[160] = {0}; char word[80]; char trial[200];
    int lines = 0;
    const char* w = s;
    while (*w && lines < maxlines) {
        while (*w == ' ') w++;
        int wi = 0;
        while (*w && *w != ' ' && wi < (int)sizeof(word) - 1) word[wi++] = *w++;
        word[wi] = 0;
        if (!wi) break;
        if (line[0]) snprintf(trial, sizeof(trial), "%s %s", line, word);
        else         snprintf(trial, sizeof(trial), "%s", word);
        if (tft.textWidth(trial) <= maxw) {
            strncpy(line, trial, sizeof(line) - 1);
        } else {
            if (line[0]) { tft.drawString(line, x, y); y += lh; lines++; strncpy(line, word, sizeof(line) - 1); }
            else         { tft.drawString(word, x, y); y += lh; lines++; line[0] = 0; }
        }
    }
    if (line[0] && lines < maxlines) { tft.drawString(line, x, y); y += lh; }
    return y;
}

// Full-screen, photographable error — big reason, plain-language hint, and the exact
// technical facts (stage / HTTP code / detail) so a photo is enough to diagnose it.
static void drawOtaError() {
    const uint16_t bg    = tft.color565(0x1c, 0x0c, 0x0c);
    const uint16_t hdrbg = tft.color565(0x86, 0x22, 0x22);
    const uint16_t panel = tft.color565(0x2a, 0x16, 0x16);
    const uint16_t white = tft.color565(0xf4, 0xea, 0xea);
    const uint16_t dim   = tft.color565(0xcf, 0xa2, 0xa2);
    const uint16_t label = tft.color565(0x9a, 0x78, 0x78);
    const uint16_t gold  = tft.color565(0xff, 0xd0, 0x55);
    tft.fillScreen(bg);
    tft.fillRect(0, 0, 240, 28, hdrbg);
    fontBig(); tft.setTextDatum(ML_DATUM); tft.setTextColor(white, hdrbg);
    tft.drawString(i18n::tr("Update error", "Ошибка обновления"), 8, 15);

