anton-vinogradov/esp32-leshy/src/main.cpp
    fontBig(); tft.setTextDatum(TL_DATUM); tft.setTextColor(gold, bg);
    tft.drawString(otaErrText(ota.err()), 12, 40);

    fontSmall(); tft.setTextColor(white, bg);
    int y = drawWrapped(otaHintText(ota.err()), 12, 72, 216, 20, 3) + 8;

    tft.fillRoundRect(6, y, 228, 300 - y, 8, panel);
    int ty = y + 10, tx = 14;
    char buf[80];
    fontSmall();
    tft.setTextColor(label, panel); tft.drawString(i18n::tr("stage", "этап"), tx, ty);
    tft.setTextColor(white, panel);
    tft.drawString(ota.failPhase() == OtaManager::DOWNLOADING ? i18n::tr("download", "загрузка")
                                                              : i18n::tr("check", "проверка"), tx + 66, ty);
    ty += 22;
    if (ota.httpCode() != 0) {
        tft.setTextColor(label, panel); tft.drawString(i18n::tr("code", "код"), tx, ty);
        snprintf(buf, sizeof(buf), "%d", ota.httpCode());
        tft.setTextColor(white, panel); tft.drawString(buf, tx + 66, ty);
        ty += 22;
    }
    if (ota.detail()[0]) {
        tft.setTextColor(label, panel); tft.drawString(i18n::tr("detail", "детали"), tx, ty); ty += 18;
        fontTiny(); tft.setTextColor(dim, panel);
        ty = drawWrapped(ota.detail(), tx, ty, 208, 15, 3) + 4;
        fontSmall();
    }
    snprintf(buf, sizeof(buf), "%s%s", i18n::tr("installed v", "стоит v"), OtaManager::current());
    tft.setTextColor(label, panel); tft.drawString(buf, tx, ty);

    fontTiny(); tft.setTextColor(dim, bg);
    tft.setTextDatum(ML_DATUM); tft.drawString(i18n::tr("◀ back", "◀ назад"), 8, 309);
    tft.setTextDatum(MR_DATUM); tft.drawString(i18n::tr("retry ▶", "повтор ▶"), 232, 309);
    fontOff();
}

// The progress "slider" with the current step written on it (redrawn alone on % change).
static void otaBar() {
    const int x = 16, y = 268, w = 208, h = 26;
    const uint16_t barbg = tft.color565(0x14, 0x1a, 0x14);
    const uint16_t panel = tft.color565(0x0b, 0x11, 0x0b);
    static TFT_eSprite bar(&tft);
    static bool made = false;
    if (!made) { bar.createSprite(w, h); bar.loadFont(font_ru_small); made = true; }
    const char* label; int pct; uint16_t fill;
    switch (ota.phase()) {
        case OtaManager::CHECKING:    label = i18n::tr("Checking...", "Проверяю...");        pct = 12;  fill = tft.color565(0x7a, 0x6a, 0x2a); break;
        case OtaManager::UPTODATE:    label = i18n::tr("Latest version", "Последняя версия"); pct = 100; fill = tft.color565(0x2e, 0x6a, 0x3e); break;
        case OtaManager::AVAILABLE:   label = i18n::tr("OK: update", "OK: обновить");         pct = 0;   fill = tft.color565(0xff, 0xcf, 0x3f); break;
        case OtaManager::DOWNLOADING: { static char b[28]; snprintf(b, sizeof(b), "%s %d%%", i18n::tr("Downloading", "Загрузка"), ota.progress()); label = b; pct = ota.progress(); fill = tft.color565(0x2e, 0x8a, 0x3e); break; }
        case OtaManager::DONE:        label = i18n::tr("Done! reboot...", "Готово! рестарт..."); pct = 100; fill = tft.color565(0x2e, 0x8a, 0x3e); break;
        case OtaManager::FAILED:      label = otaErrText(ota.err());                          pct = 100; fill = tft.color565(0x8a, 0x2a, 0x2a); break;
        default:                      label = "";                                            pct = 0;   fill = barbg; break;
    }
    bar.fillSprite(panel);                    // compose off-screen, push once — no flicker
    bar.fillRoundRect(0, 0, w, h, 7, barbg);
    int fw = (w - 4) * pct / 100;
    if (fw > 0) bar.fillRoundRect(2, 2, fw < 6 ? 6 : fw, h - 4, 5, fill);
    bar.setTextDatum(MC_DATUM);
    bar.setTextColor(tft.color565(0xff, 0xff, 0xf2), barbg);
    bar.drawString(label, w / 2, h / 2);
    bar.pushSprite(x, y);
}

static void drawOtaScreen() {
    if (ota.phase() == OtaManager::FAILED) { drawOtaError(); return; }
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t dim   = tft.color565(0xbe, 0xc8, 0xb6);
    const uint16_t amber = tft.color565(0xff, 0xa5, 0x2a);
    const uint16_t panel = tft.color565(0x0b, 0x11, 0x0b);
    tft.setSwapBytes(true);
    tft.pushImage(0, 0, IMG_RIDER_W, IMG_RIDER_H, img_rider);   // rider = the whole background
    tft.setSwapBytes(false);
    tft.fillRoundRect(6, 196, 228, 118, 10, panel);             // dark panel for legible text
    fontBig(); tft.setTextDatum(TL_DATUM); tft.setTextColor(gold, panel);
    tft.drawString(i18n::tr("Update", "Обновление"), 16, 204);
    fontSmall(); tft.setTextColor(dim, panel);
    String line = (ota.phase() == OtaManager::AVAILABLE)
                    ? String(i18n::tr("Available: ", "Доступно: ")) + ota.latest()
                    : String(i18n::tr("Installed: v", "Установлено: v")) + OtaManager::current();
    tft.drawString(line, 16, 236);
    otaBar();
    if (ota.phase() == OtaManager::DOWNLOADING) {
        fontTiny(); tft.setTextDatum(MC_DATUM); tft.setTextColor(amber, panel);
        tft.drawString(i18n::tr("Do not power off", "Не выключай питание"), 120, 302);
    } else {
        fontTiny(); tft.setTextDatum(ML_DATUM); tft.setTextColor(dim, panel);
        tft.drawString(i18n::tr("◀ back", "◀ назад"), 16, 302);
        if (ota.phase() == OtaManager::AVAILABLE) {
            tft.setTextDatum(MR_DATUM);
            tft.drawString(i18n::tr("update ▶", "обновить ▶"), 224, 302);
        }
    }
    fontOff();
}

static void gotoOta() {
    // Reclaim BLE RAM up-front, before the version check — not just before the download.
    // A BLE session leaves the stack resident; freeing it hands the allocator ~70 KB more
    // room so the check's TLS can't fragment the heap below the two ~16 KB contiguous record
    // buffers the download then needs (measured: post-check largest block 31 KB without this,
    // 65 KB with it). The update flow ends in a reboot, so tearing BLE down here is safe;
    // no-op if BLE never ran. Pause the scan first so we don't free BLE mid-scan.
    engine.pauseAndWait();
    if (engine.releaseBleForOta())
        Serial.printf("[OTA] BLE freed before check: free=%u largest=%u\n",
                      (unsigned)ESP.getFreeHeap(), (unsigned)ESP.getMaxAllocHeap());
    ota.startCheck(); seenOtaGen = ota.gen(); seenOtaPhase = -1; st = ST_OTA; drawOtaScreen();
}

