anton-vinogradov/esp32-leshy/src/main.cpp
static void channelLabels() {                    // static column of channel numbers
    const uint16_t bg   = uiBg();
    const uint16_t gold = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t dim  = tft.color565(0x8f, 0xa9, 0x8f);
    fontOff();
    for (int ch = 1; ch <= 13; ch++) {
        int gy = CH_TOP + (ch - 1) * CH_ROWH;
        bool clean = (ch == 1 || ch == 6 || ch == 11);
        tft.fillRect(0, gy, CH_GX, CH_ROWH, bg);
        tft.setTextDatum(MR_DATUM);
        tft.setTextColor(clean ? gold : dim, bg);
        tft.drawString(String(ch), 21, gy + CH_GH / 2, 1);
    }
}

static void drawChannelScreen() {
    const uint16_t bg = uiBg();
    uiHeaderRu(i18n::tr("Channels 2.4G", "Каналы 2.4ГГц"), i18n::tr("airtime", "эфир"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    channelLabels();
    channelGraphs();
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::tr("busy, est.", "занятость ~"));
    drawNetBadge();
}

// ---- 2.4GHz spectrum waterfall (NRF24) ----
// Flicker-free by construction: instead of scrolling a full-screen sprite (a ~31ms
// blit per frame → visible tearing), we write ONE new row directly to the panel at
// a moving cursor and never move the existing pixels — a ring-buffer waterfall with
// a bright sweep line marking "now". Each update is a 228x1 push (~0.1ms). No big
// sprite either, so ~106 KB of heap stays free.
static const int SP_X = 6, SP_Y = 46, SP_W = 228, SP_H = 220;   // plot area (legend row above, 2 label rows below)
static int      spEma[Nrf24Spectrum::CHANNELS];                 // per-channel busy level 0..255 (smoothed) — gives a full colour gradient
static uint32_t spRowAt = 0;
static int      spWy = 0;                                       // current write row within the plot (ring)
static uint8_t  spGrid[SP_W];                                   // per-column WiFi-channel marker: 0 none, 1 minor, 2 major (1/6/11)
static const uint16_t SP_BG = 0x0862;                          // near-black plot background (RGB565)
// Only the used part of the band is shown, stretched to full width: NRF ch 2..84 =
// 2402..2484 MHz covers all Wi-Fi (1..14) and Bluetooth. The dead ISM edges
// (2400..2402, 2484..2525) are dropped so channels 1..13 spread across the screen.
static const int SP_CH_LO = 2, SP_CH_HI = 84;
static inline int spNrfToX(int nc) { return (nc - SP_CH_LO) * SP_W / (SP_CH_HI - SP_CH_LO); }
static inline int spXToNrf(int x)  { return SP_CH_LO + x * (SP_CH_HI - SP_CH_LO) / SP_W; }

// Energy → heat colour: blue → cyan → green → yellow → red.
static uint16_t spColor(int e, int maxN) {
    if (e <= 0 || maxN <= 0) return SP_BG;
    float f = (float)e / maxN; if (f > 1) f = 1;
    uint8_t r, g, b;
    if      (f < 0.25f) { r = 0;                                g = (uint8_t)(f / 0.25f * 160);         b = 210; }
    else if (f < 0.50f) { r = 0;                                g = 160 + (uint8_t)((f - 0.25f) / 0.25f * 95); b = (uint8_t)(210 - (f - 0.25f) / 0.25f * 210); }
    else if (f < 0.75f) { r = (uint8_t)((f - 0.50f) / 0.25f * 255); g = 255;                            b = 0; }
    else                { r = 255;                              g = (uint8_t)(255 - (f - 0.75f) / 0.25f * 255); b = 0; }
    return tft.color565(r, g, b);
}
static const uint16_t SP_GMAJ = 0x6AA2, SP_GMIN = 0x2164;       // channel dividers: dim gold (1/6/11), faint grey-green (others)

// Push one waterfall row at the ring cursor and advance it, leaving a bright sweep
// line just ahead of the newest data. Shared by the 2.4GHz (NRF) and Sub-GHz (CC1101)
// spectrum screens — one 228x1 blit, no pixels moved, so it never flickers.
static void wfPushRow(const uint16_t* row) {
    tft.setSwapBytes(false);
    tft.pushImage(SP_X, SP_Y + spWy, SP_W, 1, (uint16_t*)row);
    spWy = (spWy + 1) % SP_H;
    tft.drawFastHLine(SP_X, SP_Y + spWy, SP_W, tft.color565(0x6a, 0x80, 0x6a));
}

// The quiet→busy colour legend, shared by both spectrum screens. Cyrillic labels
// need the smooth VLW font (font1 is ASCII-only).
static void wfLegend(uint16_t bg, uint16_t dim) {
    const int by = 32, bh = 8, bw = 118, bx = SP_X + 46;
    for (int i = 0; i < bw; i++) tft.drawFastVLine(bx + i, by, bh, spColor(i * 255 / (bw - 1), 255));
    tft.drawRect(bx - 1, by - 1, bw + 2, bh + 2, tft.color565(0x2a, 0x3a, 0x2a));
    fontTiny();
    tft.setTextColor(dim, bg);
    tft.setTextDatum(MR_DATUM); tft.drawString(i18n::tr("quiet", "тихо"), bx - 5, by + bh / 2);
    tft.setTextDatum(ML_DATUM); tft.drawString(i18n::tr("busy", "занято"), bx + bw + 5, by + bh / 2);
    fontOff();
}

static void spectrumStop() { nrf.end(); }

static void drawSpectrumScreen() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f), gold = tft.color565(0xff, 0xcf, 0x3f);
    char hr[16]; snprintf(hr, sizeof(hr), "NRF24 x%d", nrf.modules());
    uiHeaderRu(i18n::tr("2.4GHz Spectrum", "Спектр 2.4ГГц"), hr);
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    wfLegend(bg, dim);
    tft.fillRect(SP_X, SP_Y, SP_W, SP_H, SP_BG);
    tft.drawRect(SP_X - 1, SP_Y - 1, SP_W + 2, SP_H + 2, tft.color565(0x2a, 0x3a, 0x2a));
    // Explicit per-channel markers: a vertical divider column for every Wi-Fi
    // channel 1..13, plus numbers below in two rows so the two-digit ones don't
    // collide. 1/6/11 (non-overlapping) stand out in gold. The dividers are pre-drawn
    // full height and get overwritten by real energy as the waterfall fills.
    memset(spGrid, 0, sizeof(spGrid));
    tft.setTextDatum(MC_DATUM);
    for (int w = 1; w <= 13; w++) {
        int sx = spNrfToX(Nrf24Spectrum::wifiCenterNrfCh(w));
        if (sx < 0 || sx >= SP_W) continue;
        bool major = (w == 1 || w == 6 || w == 11);
        spGrid[sx] = major ? 2 : 1;
        int x = SP_X + sx;
        tft.drawFastVLine(x, SP_Y, SP_H, major ? SP_GMAJ : SP_GMIN);
        tft.drawFastVLine(x, SP_Y + SP_H + 2, 3, major ? gold : dim);
        tft.setTextColor(major ? gold : dim, bg);
        tft.drawString(String(w), x, SP_Y + SP_H + (w & 1 ? 10 : 20), 1);   // odd row higher, even row lower
    }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::tr("energy", "энергия"));
    drawNetBadge();
    memset(spEma, 0, sizeof(spEma)); spRowAt = millis(); spWy = 0;
}

static void spectrumTick() {
    uint8_t sw[Nrf24Spectrum::CHANNELS];
    nrf.sweep(sw);                                       // ~25ms across 126 channels; RPD is 1-bit per channel
    for (int c = 0; c < Nrf24Spectrum::CHANNELS; c++)
        spEma[c] += ((int)sw[c] * 255 - spEma[c]) / 8;  // smooth to a 0..255 duty level → full colour gradient
    if (millis() - spRowAt < 37) return;                // one waterfall row every ~37ms (fast scroll)
    spRowAt = millis();
    static uint16_t row[SP_W];
    for (int x = 0; x < SP_W; x++) {
        int c = spXToNrf(x);
        if (c < 0) c = 0; else if (c >= Nrf24Spectrum::CHANNELS) c = Nrf24Spectrum::CHANNELS - 1;
        if      (spEma[c] > 8)     row[x] = spColor(spEma[c], 255);       // real energy → heat gradient
        else if (spGrid[x] == 2)   row[x] = SP_GMAJ;                      // channel divider shows through quiet air
        else if (spGrid[x] == 1)   row[x] = SP_GMIN;
        else                       row[x] = SP_BG;
    }
    wfPushRow(row);                                     // one row, direct — no pixels moved, no flicker
}

// ---- Sub-GHz spectrum waterfall (CC1101) ----
// Same flicker-free ring waterfall, but the CC1101 gives a real RSSI per frequency,
// so the heat is true signal strength. RIGHT cycles the display window: whole span,
// then aimed technical bands (315/433 remotes & alarms, 868/915 mesh & LoRa).
static const int SUB_NB = 40;                           // frequencies swept per row (fewer = ~3x faster scroll; mapped across the width)
static uint8_t   subE[SUB_NB];
static int       subBin = 0;                            // sweep progress (spread across loop iterations for button responsiveness)

static void subStop() { cc.end(); }

