anton-vinogradov/esp32-leshy/src/main.cpp
static void drawSubScreen() {
    const uint16_t bg = uiBg(), dim = tft.color565(0x8f, 0xa9, 0x8f), gold = tft.color565(0xff, 0xcf, 0x3f);
    const Cc1101Spectrum::Band& b = cc.bandInfo();
    uiHeaderRu(i18n::tr("Sub-GHz Spectrum", "Спектр Sub-GHz"), "CC1101");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    wfLegend(bg, dim);
    tft.fillRect(SP_X, SP_Y, SP_W, SP_H, SP_BG);
    tft.drawRect(SP_X - 1, SP_Y - 1, SP_W + 2, SP_H + 2, tft.color565(0x2a, 0x3a, 0x2a));
    // axis: localized band name (centre) on the VLW font + the MHz range at the ends
    fontTiny();
    tft.setTextColor(gold, bg); tft.setTextDatum(MC_DATUM);
    tft.drawString(i18n::isRu() ? b.ru : b.en, SP_X + SP_W / 2, SP_Y + SP_H + 13);
    tft.setTextColor(dim, bg);
    tft.setTextDatum(ML_DATUM); tft.drawString(String(b.loKHz / 1000), SP_X, SP_Y + SP_H + 13);
    tft.setTextDatum(MR_DATUM); tft.drawString(String(b.hiKHz / 1000) + (i18n::isRu() ? " МГц" : " MHz"), SP_X + SP_W, SP_Y + SP_H + 13);
    fontOff();
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::tr("band ▶", "диапазон ▶"));
    drawNetBadge();
    spWy = 0; subBin = 0;
}

static void subTick() {
    // Sweep only a few bins per loop iteration so buttons (band switch) stay snappy —
    // a full CC1101 sweep is ~150-250ms, too long to block the input poll.
    for (int k = 0; k < 10 && subBin < SUB_NB; k++, subBin++) subE[subBin] = cc.sampleBin(subBin, SUB_NB);
    if (subBin < SUB_NB) return;                        // sweep still in progress
    subBin = 0;
    static uint16_t row[SP_W];
    for (int x = 0; x < SP_W; x++) {
        int bin = x * SUB_NB / SP_W; if (bin >= SUB_NB) bin = SUB_NB - 1;
        int e = subE[bin];
        row[x] = (e > 12) ? spColor(e, 255) : SP_BG;    // above the noise floor → heat
    }
    wfPushRow(row);
}

// ---- Wi-Fi scan selection + per-network options ----
static void ensureWifiVisible() {
    int n = engine.wifiCount();
    if (wifiSel > n - 1) wifiSel = n - 1;
    if (wifiSel < 0) wifiSel = 0;
    if (wifiSel < off) off = wifiSel;
    if (wifiSel >= off + UI_VISIBLE) off = wifiSel - UI_VISIBLE + 1;
    if (off < 0) off = 0;
}

static void gotoWifi() {
    if (scanPausedAt && millis() - scanPausedAt > 5000) engine.clearSparks();  // long gap → the graph would splice two sessions into one line
    scanPausedAt = 0;
    engine.setMode(ScanEngine::SCAN_WIFI); engine.resume();
    st = ST_WIFI; seenWifiGen = engine.wifiGen();
    ensureWifiVisible();
    tft.fillRect(0, 28, 240, 320 - 28, uiBg());   // clear the canvas once on entry; ticks repaint rows only
    drawList(true);
}

static void openNetOptions() {
    if (!engine.wifiRow(wifiSel, netSel)) return;
    engine.pause();                          // freeze the scan while the menu is open
    scanPausedAt = millis();                 // remember when, so a long detour resets the RSSI graph on return
    String mine; bool isMine = net.isMine(netSel.bssid, mine);
    optTitle = netSel.ssid.length() ? netSel.ssid : (isMine ? mine : String(i18n::tr("<hidden>", "<скрытая>")));
    optN = 0;
    optLabels[optN] = i18n::tr("Details", "Подробнее"); optIds[optN] = OPT_NET_DETAILS; optN++;
    optSel = 0; optReturn = ST_WIFI;
    st = ST_OPTIONS; drawOptionsScreen();
}

static void drawNetDetails() {
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t dim   = tft.color565(0x8f, 0xa9, 0x8f);
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    String mine; bool isMine = net.isMine(netSel.bssid, mine);
    bool named = netSel.ssid.length() > 0;
    String name = named ? netSel.ssid : (isMine ? mine : String(i18n::tr("<hidden>", "<скрытая>")));
    uiHeaderRu(i18n::tr("Network", "Сеть"));
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    fontSmall(); tft.setTextDatum(TL_DATUM);
    int y = 46;
    tft.setTextColor(dim, bg);  tft.drawString(i18n::tr("Name", "Имя"), 14, y); y += 22;
    tft.setTextColor(isMine ? gold : white, bg);
    tft.drawString((isMine ? String("* ") : String("")) + name, 22, y); y += 30;
    char mac[18];
    snprintf(mac, sizeof(mac), "%02X:%02X:%02X:%02X:%02X:%02X", netSel.bssid[0], netSel.bssid[1], netSel.bssid[2], netSel.bssid[3], netSel.bssid[4], netSel.bssid[5]);
    tft.setTextColor(dim, bg); tft.drawString("BSSID", 14, y); y += 20;
    fontOff(); tft.setTextColor(white, bg); tft.drawString(mac, 22, y, 2); fontSmall(); y += 30;
    tft.setTextColor(dim, bg); tft.drawString(i18n::tr("Channel", "Канал"), 14, y);
    tft.setTextDatum(TR_DATUM); tft.setTextColor(white, bg); tft.drawString(String(netSel.channel), 226, y); tft.setTextDatum(TL_DATUM); y += 24;
    tft.setTextColor(dim, bg); tft.drawString("RSSI", 14, y);
    tft.setTextDatum(TR_DATUM); tft.setTextColor(white, bg); tft.drawString(String(netSel.rssi) + " dBm", 226, y); tft.setTextDatum(TL_DATUM); y += 24;
    tft.setTextColor(dim, bg); tft.drawString(i18n::tr("Security", "Шифр"), 14, y);
    tft.setTextDatum(TR_DATUM); tft.setTextColor(white, bg); tft.drawString(WifiScanner::authName(netSel.auth), 226, y); tft.setTextDatum(TL_DATUM); y += 26;
    if (netSel.hidden) { tft.setTextColor(tft.color565(0xff, 0xa5, 0x2a), bg); tft.drawString(i18n::tr("hidden network", "скрытая сеть"), 14, y); }
    uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back");
    fontOff();
    drawNetBadge();
}

// ---- Responsible-use notice: full text, scrollable, must be read to the end ----
static const int LEG_TOP = 34, LEG_LH = 15, LEG_LINES = 17;   // visible text lines
static String  legLines[220];                                  // wrapped lines
static int     legN = 0, legOff = 0;
static bool    legAccepted = false;      // read to the end in this viewing
static bool    legFirstRun = false;      // gate at boot (must accept once)

static bool legalSeen() { Preferences p; p.begin("leshy", true); bool v = p.getBool("legal_ok", false); p.end(); return v; }
static void legalMarkSeen() { Preferences p; p.begin("leshy", false); p.putBool("legal_ok", true); p.end(); }

static void legalWrap() {                 // wrap the doc into display lines (smooth font metrics)
    const LegalDoc& d = i18n::isRu() ? LEGAL_DOC_RU : LEGAL_DOC_EN;
    fontTiny();
    legN = 0; legOff = 0; legAccepted = false;
    for (int i = 0; i < d.n && legN < 218; i++) {
        String par = d.p[i];
        if (par.length() == 0) { legLines[legN++] = ""; continue; }
        bool head = par.startsWith("#");
        if (head) par = par.substring(2);
        String cur, word;
        for (int k = 0; k <= (int)par.length(); k++) {
            char c = (k < (int)par.length()) ? par[k] : ' ';
            if (c == ' ') {
                String test = cur.length() ? cur + " " + word : word;
                if (tft.textWidth(test) > 222 && cur.length()) { legLines[legN++] = (head ? "#" : "") + cur; cur = word; }
                else cur = test;
                word = "";
                if (legN >= 218) break;
            } else word += c;
        }
        if (cur.length() && legN < 218) legLines[legN++] = (head ? "#" : "") + cur;
    }
    fontOff();
}

static void drawLegalScreen() {
    const uint16_t bg = uiBg();
    const uint16_t white = tft.color565(0xe8, 0xe8, 0xe0);
    const uint16_t gold  = tft.color565(0xff, 0xcf, 0x3f);
    const uint16_t dim   = tft.color565(0x8f, 0xa9, 0x8f);
    int maxOff = legN - LEG_LINES; if (maxOff < 0) maxOff = 0;
    if (legOff >= maxOff) legAccepted = true;         // scrolled to the end = read
    char pct[12]; snprintf(pct, sizeof(pct), "%d%%", maxOff ? (legOff * 100 / maxOff) : 100);
    uiHeaderRu(i18n::tr("Responsible use", "Ответственность"), pct);
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    fontTiny();
    tft.setTextDatum(TL_DATUM);
    for (int i = 0; i < LEG_LINES; i++) {
        int idx = legOff + i;
        if (idx >= legN) break;
        String ln = legLines[idx];
        bool head = ln.startsWith("#");
        if (head) ln = ln.substring(1);
        tft.setTextColor(head ? gold : white, bg);
        tft.drawString(ln, 9, LEG_TOP + i * LEG_LH);
    }
    if (legFirstRun)
        uiFooterRu(legAccepted ? (i18n::isRu() ? "OK — принимаю" : "OK — I accept")
                               : (i18n::isRu() ? "листай вниз" : "scroll down"),
                   legAccepted ? "" : (i18n::isRu() ? "до конца ▼" : "to the end ▼"));
    else
        uiFooterRu(i18n::isRu() ? "◀ назад" : "◀ back", i18n::isRu() ? "листай ▼" : "scroll ▼");
    fontOff();
}

static void gotoLegal(bool firstRun) {
    legFirstRun = firstRun;
    legalWrap();
    st = ST_LEGAL;
    drawLegalScreen();
}

// First boot: pick the language, then the notice must be read before anything else.
static const char* const LANGPICK[] = { "English", "Русский" };
static int langPickSel = 1;

static void drawLangPick() {
    const uint16_t bg = uiBg();
    const uint16_t gold = tft.color565(0xff, 0xcf, 0x3f);
    uiHeaderRu("ESP32-Leshy");
    tft.fillRect(0, 28, 240, 320 - 28, bg);
    fontSmall();
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(gold, bg);
    tft.drawString("Language / Язык", 120, 70);
    fontOff();
    for (int i = 0; i < 2; i++) drawActionBtn(120 + i * 48, LANGPICK[i], i == langPickSel);
    uiFooterRu("", "OK ▶");
}

static void back() {
    switch (st) {
        case ST_LANGPICK:  return;                                         // no way out before choosing
        case ST_LEGAL:     if (legFirstRun) return;                        // must accept on first run
                           showMenu();                                     return;
        case ST_DEAUTH:    detector.stop(); showMenu();                    return;
        case ST_CHANNELS:  airtime.stop(); showMenu();                     return;
        case ST_SPECTRUM:  spectrumStop(); showMenu();                     return;
        case ST_SUBSPECTRUM: subStop(); showMenu();                        return;
        case ST_NETINFO:   gotoWifi();                                     return;
        case ST_OTA:       if (ota.busy()) return;   // checking or downloading — stay put
                           showMenu();                                     return;
        case ST_PROVISION: net.stopProvision(); gotoConn();               return;
        case ST_CONFIRM:   cancelConfirm();                               return;
        case ST_OPTIONS:   if (optReturn == ST_HIDDEN) gotoHidden(); else if (optReturn == ST_WIFI) gotoWifi(); else showMenu(); return;
        case ST_MENU:      if (depth > 0) { depth--; showMenu(); }        return;
        default:           showMenu();                                    return;  // WIFI/BLE/INFO/CONN/HIDDEN
    }
}

static void launch(int feat) {
    // An OTA check/download owns the radio — never start a screen that touches it.
    if (ota.busy() && feat != F_OTA) return;
    if (st == ST_DEAUTH)    detector.stop();       // release promiscuous before anything else
    if (st == ST_CHANNELS)  airtime.stop();        // also promiscuous
    if (st == ST_SPECTRUM)  spectrumStop();        // release NRF24
    if (st == ST_SUBSPECTRUM) subStop();           // release CC1101
    if (st == ST_PROVISION) net.stopProvision();   // drop the SoftAP + portal
    engine.pause();                                // scanning is off unless the target feature turns it back on
    infoAction = -1;                               // most info screens aren't adjustable; the two that are set this
    switch (feat) {
        case F_WIFI_SCAN:   wifiSel = 0; off = 0; engine.clearSparks(); gotoWifi(); break;
        case F_CONN:        connSel = 0; gotoConn(); break;
        case F_HIDDEN:      hidSel = 0; hidOff = 0; gotoHidden(); break;
        case F_DEAUTH:      engine.pauseAndWait();     // promiscuous needs the radio to itself
                            if (detector.begin()) { st = ST_DEAUTH; drawDeauthScreen(); }
                            else { infoTitle = i18n::tr("Deauth monitor", "Детектор атак"); infoBody = i18n::tr("Radio busy", "Радио занято"); infoNote = ""; st = ST_INFO; drawInfo(); }
                            break;
        case F_CHANNELS:    engine.pauseAndWait();          // airtime needs the radio to itself (promiscuous)
                            if (airtime.begin()) { st = ST_CHANNELS; memset(chHist, 0, sizeof(chHist)); chHead = 0; drawChannelScreen(); }
                            else { infoTitle = i18n::tr("Channels 2.4G", "Каналы 2.4ГГц"); infoBody = i18n::tr("Radio busy", "Радио занято"); infoNote = ""; st = ST_INFO; drawInfo(); }
                            break;
        case F_SPECTRUM:    engine.pause();                 // NRF24 is a separate SPI radio; free the ESP radio's CPU load anyway
                            if (nrf.begin()) { st = ST_SPECTRUM; drawSpectrumScreen(); }
                            else { infoTitle = i18n::tr("2.4GHz Spectrum", "Спектр 2.4ГГц"); infoBody = i18n::tr("NRF24 not found", "NRF24 не найден");
                                   infoNote = i18n::tr("This build expects an NRF24 module in slot 2.", "Нужен модуль NRF24 в слоте 2."); st = ST_INFO; drawInfo(); }
                            break;
        case F_SUBSPECTRUM: engine.pause();
                            if (cc.begin()) { cc.setBand(0); st = ST_SUBSPECTRUM; drawSubScreen(); }
                            else { infoTitle = i18n::tr("Sub-GHz Spectrum", "Спектр Sub-GHz"); infoBody = i18n::tr("CC1101 not found", "CC1101 не найден");
                                   infoNote = i18n::tr("This build expects a CC1101 sub-GHz module.", "Нужен модуль CC1101."); st = ST_INFO; drawInfo(); }
                            break;
        case F_BLE_SCAN:    engine.setMode(ScanEngine::SCAN_BLE);  engine.resume(); st = ST_BLE;  off = 0; seenBleGen  = engine.bleGen();
                            tft.fillRect(0, 28, 240, 320 - 28, uiBg()); drawList(true); break;
        case F_SUBGHZ_SOON: infoTitle = i18n::tr("Sub-GHz Recorder", "Запись Sub-GHz"); infoBody = i18n::tr("Record / replay 315-868 MHz", "Запись/повтор 315-868 МГц"); infoNote = i18n::tr("Coming soon (needs CC1101)", "Скоро (нужен CC1101)"); st = ST_INFO; drawInfo(); break;
        case F_ABOUT:       st = ST_INFO; drawAboutScreen(); break;
        case F_LEGAL:       gotoLegal(false); break;
        case F_OTA:         gotoOta(); break;
        case F_LEDS:        drawLedsInfo(); break;         // shows current; SELECT/RIGHT cycles in place
        case F_BACKLIGHT:   drawBacklightInfo(); break;
        case F_RECAL:       touchRecalibrate(); showMenu(); break;
        case F_LANG_EN:     i18n::set(Lang::EN); saveLang(Lang::EN); if (depth > 0) depth--; showMenu(); break;
        case F_LANG_RU:     i18n::set(Lang::RU); saveLang(Lang::RU); if (depth > 0) depth--; showMenu(); break;
    }
}

static void activate() {
    const MenuItem& it = MENUS[curMenu()].items[curSel()];
    if (it.kind == K_SUB) { depth++; menuStack[depth] = it.target; selStack[depth] = 0; showMenu(); }
    else launch(it.target);
}

