anton-vinogradov/esp32-leshy/src/main.cpp
    // ---- deauth monitor: hop channels + refresh stats ----
    if (st == ST_DEAUTH) {
        detector.loop();
        static uint32_t nextDeauthDraw = 0;
        if (millis() - nextDeauthDraw > 400) { nextDeauthDraw = millis(); deauthRefresh(); }
    }

    // ---- provisioning portal ----
    if (st == ST_PROVISION) {
        net.loopProvision();
        if (net.pendingConnect()) {
            net.stopProvision();     // saves creds + switches to STA (AP drops)
            infoTitle = i18n::tr("Connecting...", "Подключение..."); infoBody = net.savedSsid(); infoNote = ""; infoAction = -1;
            st = ST_INFO; drawInfo();
            net.connect();
            if (net.connected()) ota.startCheck();   // auto-check for updates on connect
            gotoConn();              // land on the connection screen with the fresh status
        }
    }

    // ---- live updates ----
    if (st == ST_WIFI && engine.wifiGen() != seenWifiGen) {
        seenWifiGen = engine.wifiGen();
        ensureWifiVisible();
        drawList(true);
    } else if (st == ST_BLE && engine.bleGen() != seenBleGen) {
        seenBleGen = engine.bleGen();
        int m = engine.bleCount() - UI_VISIBLE; if (m < 0) m = 0; if (off > m) off = m;
        drawList(true);
    } else if (st == ST_OTA && ota.gen() != seenOtaGen) {
        seenOtaGen = ota.gen();
        if ((int)ota.phase() != seenOtaPhase) { seenOtaPhase = (int)ota.phase(); drawOtaScreen(); }
        else otaBar();                       // % change → repaint just the slider (no bg redraw)
    }

    // Channel graphs scroll on a steady tick (cardiograph feel) from real airtime.
    if (st == ST_CHANNELS) {
        airtime.loop();             // hop channels; each is refreshed as the sweep visits it
        static uint32_t nextCh = 0;
        if (millis() - nextCh > 120) {
            nextCh = millis();
            channelSample();
            channelGraphs();        // header/footer untouched — no flicker
        }
    }

    // 2.4GHz spectrum waterfall
    if (st == ST_SPECTRUM) spectrumTick();
    // Sub-GHz spectrum waterfall
    if (st == ST_SUBSPECTRUM) subTick();

    if (millis() > 8000) ota.markHealthy();  // once the UI has clearly been up, confirm this image

    delay(10);
}

#elif DEMO == DEMO_BTNTEST

Buttons buttons;

void setup() {
    Serial.begin(115200);
    delay(300);
    if (!buttons.begin()) {
        Serial.println("[BtnTest] PCF8574 not found on I2C (0x20-0x27).");
        return;
    }
    Serial.printf("[BtnTest] PCF8574 @ 0x%02X. Press one button at a time; I'll print its bit.\n",
                  buttons.addr());
}

void loop() {
    static uint8_t last = 0xFF;
    uint8_t v = buttons.readRaw();
    uint8_t edge = last & ~v;                    // released -> pressed
    for (int b = 0; b < 8; b++) {
        if (edge & (1 << b)) Serial.printf("pressed bit %d  (raw=0x%02X)\n", b, v);
    }
    last = v;
    delay(30);
}

#elif DEMO == DEMO_TOUCHCAL

void setup() {
    Serial.begin(115200);
    delay(300);
    displayInit();
    tft.fillScreen(TFT_BLACK);
    tft.setTextDatum(MC_DATUM);
    tft.setTextColor(TFT_WHITE, TFT_BLACK);
    tft.drawString("Touch the arrows", 120, 160, 2);

    uint16_t cal[5];
    tft.calibrateTouch(cal, TFT_WHITE, TFT_BLACK, 18);
    Serial.printf("TOUCH_CAL = { %u, %u, %u, %u, %u };\n",
                  cal[0], cal[1], cal[2], cal[3], cal[4]);

    tft.fillScreen(TFT_BLACK);
    tft.drawString("Done — tap to test", 120, 160, 2);
}

void loop() {
    uint16_t x, y;
    if (tft.getTouch(&x, &y)) {
        tft.fillCircle(x, y, 3, TFT_GREEN);
        Serial.printf("touch %u,%u\n", x, y);
    }
}

#endif
